In [1]:
# Dependencies

# Pandas
import pandas as pd

# SQL Alchemy
import sqlalchemy
    # Imports the method used for connecting to DBs
from sqlalchemy import create_engine
    # Imports the methods needed to abstract classes into tables
from sqlalchemy.ext.declarative import declarative_base
    # Allow us to declare column types
from sqlalchemy import Column, Integer, String, Float 

Base = declarative_base()

# MatPlotLib/NumPy/SciPy
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import scipy.stats as stats

In [2]:
engine = create_engine('postgresql://postgres:melsie@localhost:5432/employee_db')
connection = engine.connect()

In [5]:
employees_data = pd.read_sql("SELECT * FROM Employees",connection)
salary_data = pd.read_sql("SELECT * FROM Salaries",connection)
title_data = pd.read_sql("SELECT * FROM Titles",connection)

In [6]:
employees_data.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [7]:
salary_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [8]:
title_data .head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer